{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Bhavesh Bhatt: https://www.youtube.com/playlist?list=PLreVlKwe2Z0Sf3lEsAJ0E7kv60vdhnUR7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "import pandas as pd\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Start Neo4j services and create a blank project.\n",
    "\n",
    "If it is Neo4j sandbox, login and then enter related information below. Also ensure to create a blank project."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://34.200.226.61:7687\",\n",
    "              user=\"neo4j\",\n",
    "              password=\"installations-march-forecasts\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "Instagram = Node(\"Social_Media\", title=\"Instagram\", tagline=\"Capture and Share the World's Moments\")\n",
    "Facebook = Node(\"Social_Media\",  title=\"Facebook\", tagline=\"It's quick and easy\")\n",
    "WhatsApp = Node(\"Social_Media\",  title=\"WhatsApp\", tagline=\"Hey there, I am using WhatsApp\")\n",
    "SnapChat = Node(\"Social_Media\", title=\"SnapChat\", tagline=\"THe fastest way to share a moment\")\n",
    "Youtube = Node(\"Social_Media\", title=\"Youtube\", tagline=\"Broadcast Yourself\")\n",
    "Twitter = Node(\"Social_Media\", title=\"Twitter\", tagline=\"Here, your voice matters\")\n",
    "LinkedIn = Node(\"Social_Media\", title=\"LinkedIn\", tagline=\"Sum up your Professional brand\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "Chandler = Node(\"Person\", name=\"Chandler Bing\", dob=1968, country=\"USA\", sex=\"Male\")\n",
    "Rachel = Node(\"Person\", name=\"Rachel Green\", dob=1969, country=\"USA\", sex=\"Female\")\n",
    "Joey = Node(\"Person\", name=\"Joey Tribbiani\", dob=1967, country=\"USA\", sex=\"Male\")\n",
    "Ross = Node(\"Person\", name=\"Ross Geller\", dob=1967, country=\"USA\", sex=\"Male\")\n",
    "Monica = Node(\"Person\", name=\"Monica Geller\", dob=1967, country=\"USA\", sex=\"Female\")\n",
    "Phoebe = Node(\"Person\", name=\"Phoebe Buffay\", dob=1971, country=\"USA\", sex=\"Female\")\n",
    "\n",
    "Abhijit = Node(\"Person\", name=\"Abhijit Singh \", dob=1980, country=\"India\", sex=\"Male\")\n",
    "ACP = Node(\"Person\", name=\"ACP Pradyuman \", dob=1960, country=\"India\", sex=\"Male\")\n",
    "Tarika = Node(\"Person\", name=\"DR Tarika \", dob=1986, country=\"India\", sex=\"Female\")\n",
    "Purvi = Node(\"Person\", name=\"Purvi Sayed \", dob=1988, country=\"India\", sex=\"Female\")\n",
    "Shreya = Node(\"Person\", name=\"Shreya Chedda\", dob=1985, country=\"India\", sex=\"Female\")\n",
    "Salunkhe = Node(\"Person\", name=\"Dr R.P. Salunkhe \", dob=1965, country=\"India\", sex=\"Male\")\n",
    "Fredricks = Node(\"Person\", name=\"Fredricks \", dob=1975, country=\"India\", sex=\"Male\")\n",
    "Sachin = Node(\"Person\", name=\"Inspector Sachin\", dob=1987, country=\"India\", sex=\"Male\")\n",
    "Nikhil = Node(\"Person\", name=\"Inspector Nikhil \", dob=1990, country=\"India\", sex=\"Male\")\n",
    "\n",
    "Bagha = Node(\"Person\", name=\"Bagha\", dob=2001, country=\"India\", sex=\"Male\")\n",
    "Peg = Node(\"Person\", name=\"Peg Legge\", dob=2006, country=\"India\", sex=\"Male\")\n",
    "Isabelle = Node(\"Person\", name=\"Isabelle Ringing\", dob=2005, country=\"India\", sex=\"Female\")\n",
    "Anne = Node(\"Person\", name=\"Anne Teak\", dob=2001, country=\"USA\", sex=\"Female\")\n",
    "Rose = Node(\"Person\", name=\"Rose Bush\", dob=1998, country=\"USA\", sex=\"Female\")\n",
    "Melody = Node(\"Person\", name=\"Melody Sunshine\", dob=1999, country=\"USA\", sex=\"Male\")\n",
    "Chew = Node(\"Person\", name=\"Chew Mee \", dob=1999, country=\"USA\", sex=\"Male\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(Instagram | Facebook | WhatsApp | SnapChat \n",
    "             | Youtube | Twitter | LinkedIn)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(Chandler | Rachel | Joey | Ross | Monica | Phoebe\n",
    "             | Bagha | Peg | Isabelle | Anne | Rose | Melody \n",
    "             | Chew | Abhijit | ACP | Tarika |Purvi | Shreya\n",
    "             | Salunkhe | Fredricks | Sachin | Nikhil)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(Relationship(Joey, \"Uses\", SnapChat, joinedyear=2014, screentime=47, rating=3))\n",
    "graph.create(Relationship(Ross, \"Uses\", LinkedIn, joinedyear=2010, screentime=64, rating=5))\n",
    "graph.create(Relationship(Ross, \"Uses\", Twitter, joinedyear=2013, screentime=60, rating=4.6))\n",
    "graph.create(Relationship(Monica, \"Uses\", Facebook, joinedyear=2019, screentime=97, rating=4.5))\n",
    "graph.create(Relationship(Phoebe, \"Uses\", Facebook, joinedyear=2018, screentime=20, rating=3))\n",
    "graph.create(Relationship(Bagha, \"Uses\", Facebook, joinedyear=2016, screentime=69, rating=4.9))\n",
    "graph.create(Relationship(Peg, \"Uses\", Facebook, joinedyear=2013, screentime=94, rating=1))\n",
    "graph.create(Relationship(Peg, \"Uses\", LinkedIn, joinedyear=2011, screentime=34, rating=4.8))\n",
    "graph.create(Relationship(Isabelle, \"Uses\", Youtube, joinedyear=2008, screentime=104, rating=4.6))\n",
    "graph.create(Relationship(Isabelle, \"Uses\", Twitter, joinedyear=2016, screentime=24, rating=1.8))\n",
    "graph.create(Relationship(Isabelle, \"Uses\", Instagram, joinedyear = 2014, screentime = 120, rating = 4.8))\n",
    "graph.create(Relationship(Anne, \"Uses\", Youtube, joinedyear=2009, screentime=14, rating=5))\n",
    "graph.create(Relationship(Anne, \"Uses\", SnapChat, joinedyear=2013, screentime=36, rating=3.8))\n",
    "graph.create(Relationship(Anne, \"Uses\", LinkedIn, joinedyear=2017, screentime=20, rating=4))\n",
    "graph.create(Relationship(Chandler, \"Uses\", Facebook, joinedyear=2016, screentime=30, rating=2))\n",
    "graph.create(Relationship(Chandler, \"Uses\", WhatsApp, joinedyear=2016, screentime=70, rating=3))\n",
    "graph.create(Relationship(Chandler, \"Uses\", Instagram, joinedyear=2012, screentime=150, rating=4.9))\n",
    "graph.create(Relationship(Rachel, \"Uses\", WhatsApp, joinedyear=2018, screentime=100, rating=4))\n",
    "\n",
    "graph.create(Relationship(Phoebe, \"Uses\", WhatsApp, joinedyear=2010, screentime=25, rating=5))\n",
    "graph.create(Relationship(Rachel, \"Uses\", WhatsApp, joinedyear=2011, screentime=10, rating=4))\n",
    "graph.create(Relationship(Bagha, \"Uses\", WhatsApp, joinedyear=2012, screentime=15, rating=5))\n",
    "graph.create(Relationship(Monica, \"Uses\", WhatsApp, joinedyear=2013, screentime=30, rating=4))\n",
    "graph.create(Relationship(Peg, \"Uses\", WhatsApp, joinedyear=2014, screentime=35, rating=5))\n",
    "graph.create(Relationship(Ross, \"Uses\", WhatsApp, joinedyear=2015, screentime=40, rating=4))\n",
    "graph.create(Relationship(Isabelle, \"Uses\", WhatsApp, joinedyear=2016, screentime=45, rating=5))\n",
    "graph.create(Relationship(Anne, \"Uses\", WhatsApp, joinedyear=2017, screentime=50, rating=4))\n",
    "graph.create(Relationship(Joey, \"Uses\", WhatsApp, joinedyear=2018, screentime=55, rating=5))\n",
    "\n",
    "graph.create(Relationship(Abhijit, \"Uses\", Instagram, joinedyear=2018, screentime=80, rating=5))\n",
    "graph.create(Relationship(ACP, \"Uses\", Twitter, joinedyear=2014, screentime=20, rating=3))\n",
    "graph.create(Relationship(Tarika, \"Uses\", Instagram, joinedyear=2015, screentime=130, rating=4))\n",
    "graph.create(Relationship(Purvi, \"Uses\", Instagram, joinedyear=2017, screentime=100, rating=4))\n",
    "graph.create(Relationship(Shreya, \"Uses\", Instagram, joinedyear=2018, screentime=40, rating=4))\n",
    "graph.create(Relationship(Salunkhe, \"Uses\", LinkedIn, joinedyear=2019, screentime=10, rating=3))\n",
    "graph.create(Relationship(Fredricks, \"Uses\", Youtube, joinedyear=2013, screentime=30, rating=3))\n",
    "graph.create(Relationship(Sachin, \"Uses\", Youtube, joinedyear=2010, screentime=40, rating=4))\n",
    "graph.create(Relationship(Nikhil, \"Uses\", Instagram, joinedyear=2012, screentime=50, rating=5))\n",
    "\n",
    "graph.create(Relationship(Rachel, \"Uses\", Facebook, joinedyear=2017, screentime=43, rating=2))\n",
    "graph.create(Relationship(Rose, \"Uses\", Twitter, joinedyear=2012, screentime=84, rating=4))\n",
    "graph.create(Relationship(Rose, \"Uses\", LinkedIn, joinedyear=2014, screentime=134, rating=1))\n",
    "graph.create(Relationship(Rose, \"Uses\", Youtube, joinedyear=2014, screentime=64, rating=4.8))\n",
    "graph.create(Relationship(Melody, \"Uses\", Twitter, joinedyear=2010, screentime=54, rating=2.9))\n",
    "graph.create(Relationship(Melody, \"Uses\", SnapChat, joinedyear=2015, screentime=76, rating=3.8))\n",
    "graph.create(Relationship(Melody, \"Uses\", WhatsApp, joinedyear=2019, screentime=87, rating=2.6))\n",
    "graph.create(Relationship(Chew, \"Uses\", Facebook, joinedyear=2017, screentime=29, rating=4.9))\n",
    "graph.create(Relationship(Chew, \"Uses\", SnapChat, joinedyear=2018, screentime=48, rating=2.8))\n",
    "graph.create(Relationship(Chew, \"Uses\", WhatsApp, joinedyear=2009, screentime=86, rating=1.6))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Which social media platform has the most number of users? (Top 5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\" \n",
    "MATCH (p:Person) - [] -> (s:Social_Media)\n",
    "RETURN s.title, COUNT(*) AS Users\n",
    "ORDER BY Users DESC\n",
    "LIMIT 5\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = graph.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'WhatsApp'\t12\n",
      "'Facebook'\t7\n",
      "'Instagram'\t7\n",
      "'Youtube'\t5\n",
      "'Twitter'\t5\n"
     ]
    }
   ],
   "source": [
    "for record in result:\n",
    "    print(record)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Which platform has the highest rating?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person) - [r] -> (s:Social_Media)\n",
    "RETURN s.title as Title, AVG(r.rating) as Rating\n",
    "ORDER BY Rating DESC\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "result2 = graph.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Instagram'\t4.5285714285714285\n",
      "'Youtube'\t4.28\n",
      "'WhatsApp'\t4.016666666666667\n",
      "'LinkedIn'\t3.5599999999999996\n",
      "'SnapChat'\t3.3499999999999996\n",
      "'Twitter'\t3.2600000000000002\n",
      "'Facebook'\t3.185714285714286\n"
     ]
    }
   ],
   "source": [
    "for d in result2:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person) - [r] -> (s:Social_Media)\n",
    "RETURN s.title as Title, MAX(r.rating) as Rating\n",
    "ORDER BY Rating DESC\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Instagram'\t5\n",
      "'Youtube'\t5\n",
      "'WhatsApp'\t5\n",
      "'LinkedIn'\t5\n",
      "'Facebook'\t4.9\n",
      "'Twitter'\t4.6\n",
      "'SnapChat'\t3.8\n"
     ]
    }
   ],
   "source": [
    "result2 = graph.run(query)\n",
    "\n",
    "for d in result2:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### What is the total screen time for a user & which social media platform has the most screen time?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>User</th>\n",
       "      <th>Social Media</th>\n",
       "      <th>Screen Time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chandler Bing</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Rose Bush</td>\n",
       "      <td>LinkedIn</td>\n",
       "      <td>134</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>DR Tarika</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>130</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Isabelle Ringing</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Isabelle Ringing</td>\n",
       "      <td>Youtube</td>\n",
       "      <td>104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Purvi Sayed</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Monica Geller</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Peg Legge</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Melody Sunshine</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Chew Mee</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Rose Bush</td>\n",
       "      <td>Twitter</td>\n",
       "      <td>84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Abhijit Singh</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Melody Sunshine</td>\n",
       "      <td>SnapChat</td>\n",
       "      <td>76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Chandler Bing</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Bagha</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Rose Bush</td>\n",
       "      <td>Youtube</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Ross Geller</td>\n",
       "      <td>LinkedIn</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Ross Geller</td>\n",
       "      <td>Twitter</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Joey Tribbiani</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>55</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Melody Sunshine</td>\n",
       "      <td>Twitter</td>\n",
       "      <td>54</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Inspector Nikhil</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Anne Teak</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Chew Mee</td>\n",
       "      <td>SnapChat</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Joey Tribbiani</td>\n",
       "      <td>SnapChat</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Isabelle Ringing</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Rachel Green</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Shreya Chedda</td>\n",
       "      <td>Instagram</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Inspector Sachin</td>\n",
       "      <td>Youtube</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Ross Geller</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Anne Teak</td>\n",
       "      <td>SnapChat</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Peg Legge</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Peg Legge</td>\n",
       "      <td>LinkedIn</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Chandler Bing</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Fredricks</td>\n",
       "      <td>Youtube</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Monica Geller</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Chew Mee</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Phoebe Buffay</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Isabelle Ringing</td>\n",
       "      <td>Twitter</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Phoebe Buffay</td>\n",
       "      <td>Facebook</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>ACP Pradyuman</td>\n",
       "      <td>Twitter</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Anne Teak</td>\n",
       "      <td>LinkedIn</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Bagha</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Anne Teak</td>\n",
       "      <td>Youtube</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Rachel Green</td>\n",
       "      <td>WhatsApp</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Dr R.P. Salunkhe</td>\n",
       "      <td>LinkedIn</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 User Social Media  Screen Time\n",
       "0       Chandler Bing    Instagram          150\n",
       "1           Rose Bush     LinkedIn          134\n",
       "2          DR Tarika     Instagram          130\n",
       "3    Isabelle Ringing    Instagram          120\n",
       "4    Isabelle Ringing      Youtube          104\n",
       "5        Purvi Sayed     Instagram          100\n",
       "6       Monica Geller     Facebook           97\n",
       "7           Peg Legge     Facebook           94\n",
       "8     Melody Sunshine     WhatsApp           87\n",
       "9           Chew Mee      WhatsApp           86\n",
       "10          Rose Bush      Twitter           84\n",
       "11     Abhijit Singh     Instagram           80\n",
       "12    Melody Sunshine     SnapChat           76\n",
       "13      Chandler Bing     WhatsApp           70\n",
       "14              Bagha     Facebook           69\n",
       "15          Rose Bush      Youtube           64\n",
       "16        Ross Geller     LinkedIn           64\n",
       "17        Ross Geller      Twitter           60\n",
       "18     Joey Tribbiani     WhatsApp           55\n",
       "19    Melody Sunshine      Twitter           54\n",
       "20  Inspector Nikhil     Instagram           50\n",
       "21          Anne Teak     WhatsApp           50\n",
       "22          Chew Mee      SnapChat           48\n",
       "23     Joey Tribbiani     SnapChat           47\n",
       "24   Isabelle Ringing     WhatsApp           45\n",
       "25       Rachel Green     Facebook           43\n",
       "26      Shreya Chedda    Instagram           40\n",
       "27   Inspector Sachin      Youtube           40\n",
       "28        Ross Geller     WhatsApp           40\n",
       "29          Anne Teak     SnapChat           36\n",
       "30          Peg Legge     WhatsApp           35\n",
       "31          Peg Legge     LinkedIn           34\n",
       "32      Chandler Bing     Facebook           30\n",
       "33         Fredricks       Youtube           30\n",
       "34      Monica Geller     WhatsApp           30\n",
       "35          Chew Mee      Facebook           29\n",
       "36      Phoebe Buffay     WhatsApp           25\n",
       "37   Isabelle Ringing      Twitter           24\n",
       "38      Phoebe Buffay     Facebook           20\n",
       "39     ACP Pradyuman       Twitter           20\n",
       "40          Anne Teak     LinkedIn           20\n",
       "41              Bagha     WhatsApp           15\n",
       "42          Anne Teak      Youtube           14\n",
       "43       Rachel Green     WhatsApp           10\n",
       "44  Dr R.P. Salunkhe      LinkedIn           10"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query3 = \"\"\" \n",
    "MATCH (p:Person) - [r] -> (s:Social_Media)\n",
    "RETURN p.name AS Name, s.title AS Title, SUM(r.screentime) AS Screentime\n",
    "ORDER BY Screentime DESC\n",
    "\"\"\"\n",
    "\n",
    "result3 = graph.run(query3)\n",
    "\n",
    "df = pd.DataFrame(result3, columns = [\"User\", \"Social Media\", \"Screen Time\"])\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Find the Eldest Person & the Youngest Person with their choice of Social Media"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Eldest Person :'\t'ACP Pradyuman '\t62\t'Twitter'\n",
      "'Youngest Person: '\t'Peg Legge'\t16\t'Facebook'\n"
     ]
    }
   ],
   "source": [
    "query4 = \"\"\"\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "SET p.Name = 'Eldest Person :'\n",
    "RETURN p.Name, p.name AS Name, 2022-p.dob AS Age, s.title\n",
    "ORDER BY Age DESC\n",
    "LIMIT 1\n",
    "UNION ALL\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "SET p.Name = 'Youngest Person: '\n",
    "RETURN p.Name ,p.name AS Name, 2022-p.dob AS Age, s.title\n",
    "ORDER BY Age\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "result4 = graph.run(query4)\n",
    "for d in result4:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\t'ACP Pradyuman '\t62\t'Twitter'\n",
      "None\t'Peg Legge'\t16\t'WhatsApp'\n"
     ]
    }
   ],
   "source": [
    "query4 = \"\"\"\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "RETURN p.Name, p.name AS Name, 2022-p.dob AS Age, s.title\n",
    "ORDER BY Age DESC\n",
    "LIMIT 1\n",
    "UNION ALL\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "RETURN p.Name ,p.name AS Name, 2022-p.dob AS Age, s.title\n",
    "ORDER BY Age\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "result4 = graph.run(query4)\n",
    "for d in result4:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Find the number of male & female users for each social media platform"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'WhatsApp'\t7\t'Male'\n",
      "'SnapChat'\t3\t'Male'\n",
      "'LinkedIn'\t3\t'Male'\n",
      "'Facebook'\t4\t'Male'\n",
      "'Youtube'\t2\t'Male'\n",
      "'Twitter'\t3\t'Male'\n",
      "'Instagram'\t3\t'Male'\n",
      "'Instagram'\t4\t'Female'\n",
      "'WhatsApp'\t5\t'Female'\n",
      "'Facebook'\t3\t'Female'\n",
      "'Youtube'\t3\t'Female'\n",
      "'LinkedIn'\t2\t'Female'\n",
      "'Twitter'\t2\t'Female'\n",
      "'SnapChat'\t1\t'Female'\n"
     ]
    }
   ],
   "source": [
    "query5 = \"\"\"\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "WHERE p.sex=\"Male\"\n",
    "SET p.surname = 'Male'\n",
    "RETURN s.title, COUNT(*),p.surname AS count\n",
    "ORDER BY count DESC\n",
    "UNION ALL\n",
    "MATCH (p:Person)-[r]->(s:Social_Media)\n",
    "WHERE p.sex=\"Female\"\n",
    "SET p.surname = 'Female'\n",
    "RETURN s.title, COUNT(*),p.surname AS count\n",
    "ORDER BY count DESC\n",
    "\"\"\"\n",
    "\n",
    "result5 = graph.run(query5)\n",
    "for d in result5:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo4j",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
